podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/3.stage3Folder/peripherals/RCM_MKE15Z7.svd.xml
<!--
Devices using this peripheral: 
      MKE15Z7
-->
      <peripheral>
         <?sourceFile "RCM_MKE15Z7" ?>
         <name>RCM</name>
         <description>Reset Control Module</description>
         <groupName>RCM</groupName>
         <prependToName>RCM_</prependToName>
         <headerStructName>RCM</headerStructName>
         <baseAddress>0x4007F000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>VERID</name>
               <description>Version ID Register</description>
               <addressOffset>0x0</addressOffset>
               <access>read-only</access>
               <resetValue>0x3000003</resetValue>
               <fields>
                  <field>
                     <name>FEATURE</name>
                     <description>Feature Specification Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Standard feature set</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MINOR</name>
                     <description>Minor Version Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>MAJOR</name>
                     <description>Major Version Number</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PARAM</name>
               <description>Parameter Register</description>
               <addressOffset>0x4</addressOffset>
               <access>read-only</access>
               <resetValue>0x2EEE</resetValue>
               <fields>
                  <field>
                     <name>EWAKEUP</name>
                     <description>Existence of SRS[WAKEUP] status indication feature</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The feature is not available</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The feature is available</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="EWAKEUP" > <name>ELVD</name> <description>Existence of SRS[LVD] status indication feature</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="EWAKEUP" > <name>ELOC</name> <description>Existence of SRS[LOC] status indication feature</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="EWAKEUP" > <name>ELOL</name> <description>Existence of SRS[LOL] status indication feature</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="EWAKEUP" > <name>EWDOG</name> <description>Existence of SRS[WDOG] status indication feature</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="EWAKEUP" > <name>EPIN</name> <description>Existence of SRS[PIN] status indication feature</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="EWAKEUP" > <name>EPOR</name> <description>Existence of SRS[POR] status indication feature</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="EWAKEUP" > <name>EJTAG</name> <description>Existence of SRS[JTAG] status indication feature</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="EWAKEUP" > <name>ELOCKUP</name> <description>Existence of SRS[LOCKUP] status indication feature</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="EWAKEUP" > <name>ESW</name> <description>Existence of SRS[SW] status indication feature</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="EWAKEUP" > <name>EMDM_AP</name> <description>Existence of SRS[MDM_AP] status indication feature</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="EWAKEUP" > <name>ESACKERR</name> <description>Existence of SRS[SACKERR] status indication feature</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="EWAKEUP" > <name>ETAMPER</name> <description>Existence of SRS[TAMPER] status indication feature</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="EWAKEUP" > <name>ECORE1</name> <description>Existence of SRS[CORE1] status indication feature</description> <bitOffset>16</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SRS</name>
               <description>System Reset Status Register</description>
               <addressOffset>0x8</addressOffset>
               <access>read-only</access>
               <resetValue>0x82</resetValue>
               <fields>
                  <field>
                     <name>LVD</name>
                     <description>Low-Voltage Detect Reset or High-Voltage Detect Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by LVD trip, HVD trip or POR</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by LVD trip, HVD trip or POR</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOC</name>
                     <description>Loss-of-Clock Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by a loss of external clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by a loss of external clock</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOL</name>
                     <description>Loss-of-Lock Reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by a loss of lock in the PLL/FLL</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by a loss of lock in the PLL/FLL</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WDOG</name>
                     <description>Watchdog</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by watchdog timeout</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by watchdog timeout</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN</name>
                     <description>External Reset Pin</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by external reset pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by external reset pin</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POR</name>
                     <description>Power-On Reset</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by POR</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by POR</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOCKUP</name>
                     <description>Core Lockup</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by core LOCKUP event</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by core LOCKUP event</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SW</name>
                     <description>Software</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by software setting of SYSRESETREQ bit</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by software setting of SYSRESETREQ bit</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MDM_AP</name>
                     <description>MDM-AP System Reset Request</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset was not caused by host debugger system setting of the System Reset Request bit</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset was caused by host debugger system setting of the System Reset Request bit</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SACKERR</name>
                     <description>Stop Acknowledge Error</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Reset not caused by peripheral failure to acknowledge attempt to enter stop mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset caused by peripheral failure to acknowledge attempt to enter stop mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RPC</name>
               <description>Reset Pin Control register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>RSTFLTSRW</name>
                     <description>Reset Pin Filter Select in Run and Wait Modes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>All filtering disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Bus clock filter enabled for normal operation</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>LPO clock filter enabled for normal operation</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSTFLTSS</name>
                     <description>Reset Pin Filter Select in Stop Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>All filtering disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>LPO clock filter enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSTFLTSEL</name>
                     <description>Reset Pin Filter Bus Clock Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MR</name>
               <description>Mode Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>BOOTROM</name>
                     <description>Boot ROM Configuration</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Boot from Flash</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Boot from ROM due to BOOTCFG0 pin assertion / Reserved if no Boot pin</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Boot form ROM due to FOPT[7] configuration</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Boot from ROM due to both BOOTCFG0 pin assertion and FOPT[7] configuration</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FM</name>
               <description>Force Mode Register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>FORCEROM</name>
                     <description>Force ROM Boot</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>No effect</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Force boot from ROM with RCM_MR[1] set</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>Force boot from ROM with RCM_MR[2] set</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>Force boot from ROM with RCM_MR[2:1] set</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
